---
kind: property
id: P:Autodesk.Revit.DB.Transform.IsIdentity
zh: 变换
source: html/67276072-ca45-6c26-a249-fa6804d13053.htm
---
# Autodesk.Revit.DB.Transform.IsIdentity Property

**中文**: 变换

The boolean value that indicates whether this transformation is an identity.

## Syntax (C#)
```csharp
public bool IsIdentity { get; }
```

## Remarks
The identity transformation does not change a point or a vector that it is applied to.